app/controllers/browse_controller.rb

SELECT "songs".* FROM "songs" WHERE ("songs".genre_id IN (1,2,3,4,5,6,7,8,9))
---
  def all
    @genres = Genre.find(:all, :include=>[:songs])