app/controllers/browse_controller.rb

SELECT * FROM "genres"
---
  def all
    @genres = Genre.all