app/controllers/followed_user_controller.rb

  def new
    @followed_user = FollowedUser.new
    @followed_user.followed_id = params[:followed_id]
    @follows = User.find(params[:followed_id])
---
SELECT * FROM "users" WHERE ("users"."id" = '10') LIMIT 1

  def create
     @followed_user = FollowedUser.new(params[:followed_user]);
     @follows = User.find(@followed_user.followed_id)
     @confirm = false;
     @error_message = ''
     if @followed_user.subscriber_id == @followed_user.followed_id
        @error_message = "Sorry, you may not become a fan of yourself."
     elsif FollowedUser.find(:first, :conditions => {:subscriber_id => @followed_user.subscriber_id,
                                                     :followed_id => @followed_user.followed_id})
        @error_message = "You are already a fan of #{@follows.name}."
     else
     	@confirm = @followed_user.save
---
SELECT * FROM "users" WHERE ("users"."id" = '10') LIMIT 1
INSERT INTO "followed_users" ("created_at", "updated_at", "followed_user_id", "user_id") VALUES('2010-12-13 00:37:33', '2010-12-13 00:37:33', 3, 10)
UPDATE "users" SET "updated_at" = '2010-12-13 00:37:33', "perishable_token" = '0OaOZZyfDkHZ1h63F2fi', "last_request_at" = '2010-12-13 00:37:33' WHERE "id" = 10