app/controllers/index_controller.rb

  def index
    actions = Action.find(:all, :readonly, :limit => 20, :order => "created_at DESC")
    @actions = []
    actions.each do |a|
      current_action = {:user => User.find(a.user_id), :action => a.action, :obj_type => a.obj_type, :created_at =>a.created_at}
      puts current_action[:obj_type]
      if current_action[:obj_type] == "song"
        if current_action[:action] == "create"
          current_action[:obj] = Song.find a.obj_id
        else
          current_action[:obj] = SongComment.find a.obj_id
        end
      else
        if current_action[:action] == "create"
          current_action[:obj] = Playlist.find a.obj_id
        else
          current_action[:obj] = PlaylistComment.find a.obj_id
---
SELECT * FROM "actions" ORDER BY created_at DESC LIMIT 20
SELECT "users".* FROM "users" INNER JOIN "usersongs" ON "users".id = "usersongs".user_id WHERE (("usersongs".song_id = 49))
SELECT * FROM "songs" WHERE ("songs"."id" = 49)
SELECT * FROM "song_comments" WHERE ("song_comments"."id" = 6)
SELECT * FROM "playlists" WHERE ("playlists"."id" = 4)
SELECT * FROM "playlist_comments" WHERE ("playlist_comments"."id" = 1)