app/controllers/playlist_rating_controller.rb

  def new
    @playlist_rating = PlaylistRating.new
    @playlist = Playlist.find(params[:playlist_id])
---
SELECT * FROM "playlists" WHERE ("playlists"."id" = 7)

  def create
    @playlist_rating = PlaylistRating.find_by_user_id current_user.id
    if @playlist_rating == nil
      @playlist_rating = PlaylistRating.new(params[:playlist_rating])
    else
      @playlist_rating.update_attributes(params[:playlist_rating])
    end
    @playlist_rating.user_id = current_user.id
    @playlist_rating.playlist_id = params[:playlist_id]
    @playlist = Playlist.find(params[:playlist_id])
    @confirm = @playlist_rating.save
	if @confirm
      @playlist.updateRating
---
SELECT * FROM "playlist_ratings" WHERE ("playlist_ratings"."user_id" = 13) LIMIT 1
SELECT * FROM "playlists" WHERE ("playlists"."id" = 7)
INSERT INTO "playlist_ratings" ("rating", "playlist_id", "created_at", "updated_at", "user_id") VALUES(2, 7, '2010-11-20 23:07:44', '2010-11-20 23:07:44', 11)
UPDATE "playlists" SET "updated_at" = '2010-11-21 00:17:18', "rating" = 4.0 WHERE "id" = 7