app/controllers/playlist_comment_controller.rb

  def create
     @playlist_comment = PlaylistComment.new(params[:playlist_comment])
     @playlist_comment.user_id = @current_user.id
     @playlist_comment.playlist_id = params[:playlist_id]
     @playlist = Playlist.find(params[:playlist_id])
     respond_to do |format|
      if @playlist_comment.save
        @action = Action.new :user_id =>@current_user.id, :action =>"comment", :obj_type =>"playlist", :obj_id =>@playlist_comment.playlist_id
        @action.save
---
SELECT * FROM "playlists" WHERE ("playlists"."id" = 4)
INSERT INTO "playlist_comments" ("created_at", "playlist_id", "updated_at", "text", "user_id") VALUES('2010-12-12 21:44:58', 4, '2010-12-12 21:44:58', 'PLURRRRR', 10)
INSERT INTO "actions" ("created_at", "obj_id", "updated_at", "action", "obj_type", "user_id") VALUES('2010-12-12 21:44:58', 1, '2010-12-12 21:44:58', 'comment', 'playlist', 10)