app/controllers/playlists_controller.rb

SELECT * FROM "playlists" WHERE ("playlists"."id" = 0)
---
	def show
		@playlist = Playlist.find(params[:id])

INSERT INTO "playlists" ("name", "rating", "created_at", "updated_at", "user_id", "description") VALUES('eriamjh', NULL, '2010-11-20 23:04:56', '2010-11-20 23:04:56', 11, 'oewuhgie')
---
	def create
		@playlist = Playlist.new(params[:playlist])
		@playlist.user_id = current_user.id
		@playlist.save

SELECT * FROM "songs" WHERE ("songs"."id" = 34)
---
	def addsong
		@song_id = params[:song_id]
		@song = Song.find(@song_id)

INSERT INTO "playlistsongs" ("playlist_id", "created_at", "updated_at", "song_id") VALUES(6, '2010-11-23 04:08:51', '2010-11-23 04:08:51', 34)
SELECT * FROM "playlists" WHERE ("playlists"."id" = 6)
---
	def confirmaddsong
		song_id = params[:song_id]
		playlist_id = params[:playlist]
		plsong = Playlistsong.new
		plsong.playlist_id = playlist_id
		plsong.song_id = song_id
		@confirm = plsong.save
		@pl = Playlist.find(playlist_id)

SELECT * FROM "playlists" ORDER BY rating DESC LIMIT 100
---
  def popular
    @playlists = Playlist.find(:all, :readonly, :limit => 100, :order => "rating DESC")
    @playlists.shuffle!
    @playlists = @playlists[0..[@playlists.size-1,20].min]