app/controllers/song_rating_controller.rb

  def new
    @song_rating = SongRating.new
    @song = Song.find(params[:song_id])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 42)

  def create
    @song_rating = SongRating.find_by_user_id current_user.id
    if @song_rating == nil
      @song_rating = SongRating.new(params[:song_rating])
    else
      @song_rating.update_attributes(params[:song_rating])
    end
    @song_rating.user_id = current_user.id
    @song_rating.song_id = params[:song_id]
    @song = Song.find(params[:song_id])
    if @song_rating.save
      @song.updateRating
---
SELECT * FROM "song_ratings" WHERE ("song_ratings"."user_id" = 14) LIMIT 1
SELECT * FROM "songs" WHERE ("songs"."id" = 42)
INSERT INTO "song_ratings" ("rating", "created_at", "updated_at", "user_id", "song_id") VALUES(4, '2010-11-20 22:49:00', '2010-11-20 22:49:00', 11, 42)
UPDATE "song_ratings" SET "song_id" = 42, "updated_at" = '2010-11-23 14:21:14' WHERE "id" = 8
UPDATE "songs" SET "updated_at" = '2010-11-21 00:09:16', "rating" = 2.5 WHERE "id" = 42