app/controllers/song_comment_controller.rb

  def new
     @song_comment = SongComment.new
     @song = Song.find(params[:song_id])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 42)

  def create
     @song_comment = SongComment.new(params[:song_comment])
     @song_comment.user_id = @current_user.id
     @song_comment.song_id = params[:song_id]
     @song = Song.find(params[:song_id])
     respond_to do |format|
      if @song_comment.save
        @action = Action.new :user_id => @current_user.id, :action => "comment", :obj_type => "song", :obj_id =>@song_comment.id
        @action.save
---
SELECT * FROM "songs" WHERE ("songs"."id" = 42)
INSERT INTO "song_comments" ("created_at", "updated_at", "text", "user_id", "song_id") VALUES('2010-11-23 14:22:23', '2010-11-23 14:22:23', 'ajax test', 15, 42)
INSERT INTO "actions" ("created_at", "obj_id", "updated_at", "action", "obj_type", "user_id") VALUES('2010-12-12 21:42:42', 6, '2010-12-12 21:42:42', 'comment', 'song', 10)