app/controllers/songs_controller.rb

INSERT INTO "songs" ("rating", "name", "created_at", "updated_at", "album", "song_file_name", "song_file_size", "genre", "length", "description", "song_content_type") VALUES(NULL, 'euhgr', '2010-11-23 01:11:43', '2010-11-23 01:11:43', 'ieughie', 'Kalimba.mp3', 8414449, 'siufhb', NULL, 'ifuhgieur', 'audio/mpeg')
INSERT INTO "usersongs" ("created_at", "updated_at", "user_id", "song_id") VALUES('2010-11-20 22:46:19', '2010-11-20 22:46:19', 11, 41)
---
  def create
     @song = Song.new(params[:song])
     respond_to do |format|
       if @song.save
        @users_songs = Usersong.new({:user_id => current_user.id, :song_id => @song.id})
        if @users_songs.save

SELECT * FROM "songs" WHERE ("songs"."id" = 34)
SELECT "users".id FROM "users" INNER JOIN "usersongs" ON "users".id = "usersongs".user_id WHERE ("users"."id" = 9) AND (("usersongs".song_id = 34)) LIMIT 1
SELECT * FROM "song_comments" WHERE ("song_comments".song_id = 41)
---
  def show
    @song = Song.find(params[:id])
    @comments = @song.song_comments
    if @song.users.include?(current_user)

SELECT * FROM "songs" WHERE ("songs"."id" = 39)
---
  def edit
    @song = Song.find(params[:id])

SELECT * FROM "songs" WHERE ("songs"."id" = 39)
---
  def update
    @song = Song.find(params[:id])

SELECT * FROM "songs" WHERE ("songs"."id" = 41)
DELETE FROM "songs" WHERE "id" = 41
---
  def delete
    @song = Song.find(params[:id])
    @song.destroy

SELECT * FROM "songs" ORDER BY rating DESC LIMIT 100
---
  def popular
    @songs = Song.find(:all, :readonly, :limit => 100, :order => "rating DESC")
    @songs.shuffle!
    #grab the first 20 random songs
    @songs = @songs[0..[@songs.size-1,20].min]