app/controllers/user_sessions_controller.rb

  def create
    @user_session = UserSession.new(params[:user_session])
    respond_to do |format|
      if @user_session.save
        current_user = UserSession.find
        id = current_user && current_user.record.id
        @user = User.find(id)
---
SELECT * FROM "users" WHERE (LOWER("users".login) = 'mitchell') LIMIT 1