app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])

    success = @user && @user.save
    if success && @user.errors.empty?
---
INSERT INTO "users" ("name", "old_remember_token", "created_at", "last_request_at", "single_access_token", "photo_file_size", "crypted_password", "updated_at", "password_reset_code", "perishable_token", "photo_file_name", "activation_code", "photo_content_type", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "login_count", "persistence_token", "old_remember_token_expires_at", "bio", "last_login_ip", "login", "last_login_at", "email", "pic", "active") VALUES('Akhil', NULL, '2010-11-23 09:19:42', '2010-11-23 09:19:42', 'IylaEMyPtcp0MPMALceG', NULL, '366f757844636cfa86194bb16af73e0cc07b1df0b6381cefab9ddbe0b4ce35e8e05b2c7f4394c355fa53688dabade139a4408e7723711d4b9ea69f2c48ee1a33', '2010-11-23 09:19:42', NULL, '0GNKtmniEp6xYiwpzff', NULL, NULL, NULL, 0, '127.0.0.1', 'FTNC5tuGkEdChD693C', '2010-11-23 09:19:42', 1, '2a301c2964279d8893d88a4bb6aad61702ff98348697c7601eeeed7ffce679e927943de0bfc1ea64461c5a8b9f1bcc18f766b76e061bd57c9a94a7d0cf1f629f', NULL, 'blah blah', NULL, 'akhiln1', NULL, 'akhilads@adh.com', NULL, 't')
SELECT count(*) AS count_all FROM "users"

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '11') LIMIT 1

  def show
    @user = User.find(params[:id])
    @songs = @user.songs
    if  !@songs.nil? && @songs.length > 10
      @songs = @songs[0..9]
    end
    @playlists = @user.playlists
    if (not @playlists.nil?) && @playlists.length > 10
---
SELECT * FROM "users" WHERE ("users"."id" = '9') LIMIT 1
SELECT "songs".* FROM "songs" INNER JOIN "usersongs" ON "songs".id = "usersongs".song_id WHERE (("usersongs".user_id = 9))
SELECT * FROM "playlists" WHERE ("playlists".user_id = 9)